#《三国演义》 人物出场统计v2
import jieba
text = open(".\date\三国演义.txt", "r", encoding="utf-8").read()
excludes = {"将军", "却说", "二人", "不可", "荆州", "不能", "蜀兵", "上马",
            "如此", "商议", "如何", "主公", "军士", "左右", "军马", "引兵",
            "次日", "大喜", "天下", "东吴", "于是", "今日", "不敢", "魏兵",
            "一人", "陛下", "都督", "人马", "不知", "汉中", "只见", "众将",
            "大叫", "太守", "此人", "夫人", "后人", "背后", "城中", "天子",
            "一面", "何不", "大军", "忽报", "先生", "百姓", "何故", "然后",
            "先锋", "不如", "赶来", "原来", "令人", "江东", "下马", "喊声",
            "正是", "徐州", "忽然", "下文", "心中", "不得", "大怒", "以为",
            "可以", "大惊", "进兵", "接应", "军中", "起兵", "引军", "一军",
            "之后", "大事", "大败", "未知", "不见", "成都", "因此", "一声",
            "追赶", "粮草", "曹兵", "一齐", "分解", "回报", "分付", "只得",
            "出马", "三千", "大将", "许都", "随后", "报知", "前面", "之兵",
            "且说", "众官", "洛阳", "领兵", "何人", "星夜", "精兵", "城上",
            "之计", "不肯", "相见", "其言", "一日", "而行", "文武", "襄阳",
            "准备", "若何", "出战", "亲自", "必有", "此事", "军师", "之中",
            "伏兵", "祁山", "乘势", "忽见", "大笑", "樊城", "兄弟", "首级",
            "立于", "西川", "朝廷", "三军", "大王", "传令", "当先", "五百",
            "一彪", "坚守", "此时", "之间", "投降", "五千", "埋伏", "长安",
            "三路", "遣使", "回见", "大将军", "必然", "将士", "是夜", "小路"}

words = jieba.cut(text)
counts = {}
for word in words:
    if len(word) == 1:
        continue
    elif word == "诸葛亮" or word == "孔明曰":
        rword = "孔明"
    elif word == "玄德曰" or word == "玄德" or word == "先主":
        rword = "刘备"
    elif word == "孟德" or word == "丞相":
        rword = "曹操"
    elif word == "云长" or word == "关公":
        rword = "关羽"
    elif word == "后主":
        rword = "刘禅"
    else:
        rword = word
    counts[rword] = counts.get(rword, 0) + 1
for word in excludes:
    del counts[word]
items = list(counts.items())
items.sort(key = lambda x:x[1], reverse=True)
for i in range(30): # 前 30 排名
    man, count = items[i]
    print('{0:^4}{1:<10}{2:>5}'.format( i + 1, man, count))
